{"class_name": "Sequential", "keras_version": "2.2.2", "config": [{"class_name": "Conv2D", "config": {"data_format": "channels_last", "dtype": "float32", "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "batch_input_shape": [null, 64, 64, 3], "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "kernel_size": [5, 5], "bias_regularizer": null, "padding": "valid", "name": "conv2d_80", "filters": 32, "strides": [1, 1], "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [4, 4], "padding": "valid", "name": "max_pooling2d_76", "trainable": true, "pool_size": [4, 4]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 64, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "name": "conv2d_81", "trainable": true, "kernel_size": [4, 4]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [3, 3], "padding": "valid", "name": "max_pooling2d_77", "trainable": true, "pool_size": [3, 3]}}, {"class_name": "Conv2D", "config": {"data_format": "channels_last", "filters": 128, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_constraint": null, "use_bias": true, "activation": "relu", "dilation_rate": [1, 1], "activity_regularizer": null, "bias_constraint": null, "strides": [1, 1], "bias_regularizer": null, "padding": "valid", "name": "conv2d_82", "trainable": true, "kernel_size": [3, 3]}}, {"class_name": "MaxPooling2D", "config": {"data_format": "channels_last", "strides": [2, 2], "padding": "valid", "name": "max_pooling2d_78", "trainable": true, "pool_size": [2, 2]}}, {"class_name": "Dropout", "config": {"name": "dropout_33", "noise_shape": null, "trainable": true, "rate": 0.2, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten_14", "data_format": "channels_last", "trainable": true}}, {"class_name": "Dense", "config": {"units": 128, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_38", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dense", "config": {"units": 256, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "relu", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_39", "bias_initializer": {"class_name": "Zeros", "config": {}}}}, {"class_name": "Dropout", "config": {"name": "dropout_34", "noise_shape": null, "trainable": true, "rate": 0.4, "seed": null}}, {"class_name": "Dense", "config": {"units": 120, "trainable": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}}, "kernel_regularizer": null, "bias_constraint": null, "use_bias": true, "activation": "softmax", "activity_regularizer": null, "bias_regularizer": null, "kernel_constraint": null, "name": "dense_40", "bias_initializer": {"class_name": "Zeros", "config": {}}}}], "backend": "tensorflow"}