{"config": [{"config": {"kernel_constraint": null, "bias_constraint": null, "name": "conv2d_91", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_size": [5, 5], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "batch_input_shape": [null, 156, 156, 3], "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "activation": "relu", "dtype": "float32", "filters": 32}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_88", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "conv2d_92", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "activation": "relu", "filters": 64}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_89", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "conv2d_93", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "activation": "relu", "filters": 128}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_90", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"kernel_constraint": null, "bias_constraint": null, "name": "conv2d_94", "use_bias": true, "trainable": true, "bias_regularizer": null, "kernel_size": [3, 3], "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "strides": [1, 1], "bias_initializer": {"config": {}, "class_name": "Zeros"}, "dilation_rate": [1, 1], "kernel_regularizer": null, "data_format": "channels_last", "padding": "valid", "activity_regularizer": null, "activation": "relu", "filters": 128}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_91", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid", "strides": [2, 2]}, "class_name": "MaxPooling2D"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_45", "rate": 0.2, "seed": null}, "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_21", "data_format": "channels_last"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "name": "dense_60", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 128, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"bias_constraint": null, "name": "dense_61", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 256, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "relu"}, "class_name": "Dense"}, {"config": {"noise_shape": null, "trainable": true, "name": "dropout_46", "rate": 0.5, "seed": null}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "name": "dense_62", "activity_regularizer": null, "use_bias": true, "trainable": true, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "kernel_regularizer": null, "kernel_initializer": {"config": {"distribution": "uniform", "mode": "fan_avg", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_constraint": null, "activation": "sigmoid"}, "class_name": "Dense"}], "keras_version": "2.2.2", "backend": "tensorflow", "class_name": "Sequential"}