{"config": [{"config": {"name": "conv2d_20", "strides": [1, 1], "batch_input_shape": [null, 64, 64, 3], "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "bias_constraint": null, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "activation": "relu", "dtype": "float32", "kernel_constraint": null, "kernel_size": [5, 5], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_18", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_21", "strides": [1, 1], "bias_constraint": null, "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 64, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_19", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "conv2d_22", "strides": [1, 1], "bias_constraint": null, "padding": "valid", "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "filters": 128, "kernel_regularizer": null, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "data_format": "channels_last"}, "class_name": "Conv2D"}, {"config": {"name": "max_pooling2d_20", "strides": [2, 2], "padding": "valid", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last"}, "class_name": "MaxPooling2D"}, {"config": {"name": "dropout_6", "rate": 0.1, "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "flatten_3", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten"}, {"config": {"name": "dense_5", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 128, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dense_6", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 128, "kernel_regularizer": null, "activation": "relu", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}, {"config": {"name": "dropout_7", "rate": 0.2, "trainable": true, "seed": null, "noise_shape": null}, "class_name": "Dropout"}, {"config": {"name": "dense_7", "bias_constraint": null, "kernel_constraint": null, "use_bias": true, "trainable": true, "activity_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "bias_regularizer": null, "units": 2, "kernel_regularizer": null, "activation": "softmax", "kernel_initializer": {"config": {"scale": 1.0, "distribution": "uniform", "seed": null, "mode": "fan_avg"}, "class_name": "VarianceScaling"}}, "class_name": "Dense"}], "backend": "tensorflow", "keras_version": "2.2.2", "class_name": "Sequential"}