{"keras_version": "2.2.2", "backend": "tensorflow", "config": [{"config": {"bias_constraint": null, "dtype": "float32", "batch_input_shape": [null, 28, 28, 1], "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [5, 5], "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "filters": 32, "strides": [1, 1], "use_bias": true, "name": "conv2d_5"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_4"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "filters": 64, "strides": [1, 1], "use_bias": true, "name": "conv2d_6"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_5"}, "class_name": "MaxPooling2D"}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "padding": "valid", "dilation_rate": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_size": [3, 3], "kernel_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "trainable": true, "kernel_constraint": null, "filters": 64, "strides": [1, 1], "use_bias": true, "name": "conv2d_7"}, "class_name": "Conv2D"}, {"config": {"padding": "valid", "trainable": true, "data_format": "channels_last", "strides": [2, 2], "pool_size": [2, 2], "name": "max_pooling2d_6"}, "class_name": "MaxPooling2D"}, {"config": {"rate": 0.2, "name": "dropout_2", "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten"}, {"config": {"bias_constraint": null, "activation": "relu", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "units": 128, "name": "dense_1"}, "class_name": "Dense"}, {"config": {"rate": 0.5, "name": "dropout_3", "noise_shape": null, "seed": null, "trainable": true}, "class_name": "Dropout"}, {"config": {"bias_constraint": null, "activation": "softmax", "kernel_initializer": {"config": {"mode": "fan_avg", "scale": 1.0, "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "activity_regularizer": null, "trainable": true, "kernel_constraint": null, "use_bias": true, "units": 10, "name": "dense_2"}, "class_name": "Dense"}], "class_name": "Sequential"}